sports_backend/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    render json: Player.all