sports_backend/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    render json: Team.all

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 1]]
---
  def show
    render json: Team.find(params[:id]).to_json(methods: :players)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def players
    team = Team.find(params[:id])